{
  "locations": [
    {
      "id": 1,
      "name": "New College (your room)",
      "brief_description": "You are in New College, where your dorm locates. Sidney Smith Hall is on the east side of this building.",
      "long_description": "You are finally back in your dorm building. The familiar coziness reminds you of home...wait, isn't something missing? Why are you back here!",
      "available_commands": {
        "go east": 2,
        "put down items to submit work": 1
      },
      "items": []
    },
    {
      "id": 2,
      "name": "Sidney Smith Hall",
      "brief_description": "You are on the first floor of Sidney Smith Hall. Proceed south to Bahen Center, west to New College, and east to St. George Street.",
      "long_description": "It's the busiest time of the day at Sidney Smith as hundreds of students hurry for their next class. Hmmmm... one of your best buddies is having class upstairs, maybe you can take a look?",
      "available_commands": {
        "go south": 3,
        "go west": 1,
        "go east": 4,
        "go upstairs": 20
      },
      "items": []
    },
    {
      "id": 20,
      "name": "Sidney Smith Hall 2F",
      "brief_description": "You are in a classroom on the second floor of Sidney Smith Hall. There are stairs to go down to the ground floor.",
      "long_description": "You are in your friend's classroom on the second floor of Sidney Smith Hall who is taking a quiz. Your friend notices you and realizes what you already suspect: he accidentally took something of yours from the table when we were working in the library! He motions for you to come in and take his Trinity room key, but you need to be careful to not let the TA notice!",
      "available_commands": {
        "go downstairs": 2,
        "sneak in and out" : 20
      },
      "items": ["key"]
    },
    {
      "id": 3,
      "name": "Bahen Center",
      "brief_description": "You are on the first floor of the Bahen Center. Proceed north to Sidney Smith Hall, or east to the gate.",
      "long_description": "You are on the first floor of the Bahen Center. There are students eating and studying at the table near the windows. Your professor's office is in this building, but you can't just break in, right?",
      "available_commands": {
        "go north": 2,
        "go east": 5,
        "go upstairs": 30
      },
      "items": []
    },
    {
      "id": 30,
      "name": "Bahen Center 2F",
      "brief_description": "You are on the second floor of the Bahen Center, in Sadia's office which has ytour laptop charger. You may go downstairs to the ground floor.",
      "long_description": "You pushed the door of Sadia's office. It opened and you saw a table full of documents and cute pictures of Sadia's pets. But which drawer is your charger in?",
      "available_commands": {
        "get laptop charger": 30,
        "go downstairs": 3
      },
      "items": ["laptop charger"]
    },
    {
      "id": 4,
      "name": "St. George Street",
      "brief_description": "You are on St. George Street. Proceed south to the Main Gate, west to Sidney Smith Hall, or east to Front Campus",
      "long_description": "You are on St. George Street, the street which you walk along and across numerous times everyday for your courses. And, of course, there's the UofT-student-favorite hotdog station...what? Free hotdogs for today?",
      "available_commands": {
        "go south": 5,
        "go west": 2,
        "go east": 8,
        "buy hotdog": 4
      },
      "items": ["hotdog"]
    },
    {
      "id": 5,
      "name": "UTSG Main Gate",
      "brief_description":"You are at UTSG's main gate. Proceed north to St. George Street, south to College Street, west to Bahen, east to Myhal.",
      "long_description": "There it is, the main gate to The University of Toronto's St. George campus. Flashback to when you first visited UofT with your parents during the early fall of 12th grade. And how when leaving, under this very gate, you told them you wanted to spend the next 4 years here. You feel determined to finish this assignment and make them proud!",
      "available_commands": {
        "go north": 4,
        "go south": 6,
        "go west": 3,
        "go east": 9
      },
      "items": []
    },
    {
      "id": 6,
      "name": "College Street",
      "brief_description": "You are on College Street. Proceed north to the Main Gate. But wait, the bus is coming and there's a stray PRESTO card on the ground!",
      "long_description": "You are on College Street. You never like this street much. It's too busy and reminds you of your semesterly treks to the EX, which your friends like to refer to as the Execution Centre. You can go back north to the Main Gate. But wait, there's a stray PRESTO card lying on the ground. Everyone around you is so caught up in their day-to-day routine that no one would notice if you take the card... Quick! The bus that could take you to T&T is coming!",
      "available_commands": {
        "go north": 5,
        "get on the bus": 11
      },
      "items": ["PRESTO card"]
    },
    {
      "id": 7,
      "name": "Trinity College",
      "brief_description": "You are in the Trinity College quad. Proceed south to Front Campus. Your best buddy's dorm is located here.",
      "long_description": "You are standing in the middle of the Trinity College quad. The walls were corrupted under the brush of time, and the air amidst the ancient building feels thick with history. 'The dorm facilities are old and rusted too!', your friend once complained to you.",
      "available_commands": {
        "go south": 8,
        "go to dorm": 70
      },
      "items": []
    },
    {
      "id": 70,
      "name": "Trinity College 2F",
      "brief_description": "You are on the second floor of Trinity College, right outside your friend's dorm. You may go downstairs to the ground floor.",
      "long_description": "You are standing by the door of your friend's dorm. You'll need the key to get in. Let's hope there is something useful inside...",
      "available_commands": {
        "go downstairs": 7
      },
      "items": ["USB drive"]
    },
    {
      "id": 8,
      "name": "Front Campus",
      "brief_description": "You are on the Front Campus. Proceed north to Trinity College, south to Myhal, and west to St. George Street. There is a path below a bridge that leads to somewhere outside the campus...",
      "long_description": "You are on the Front Campus. Today is a nice day and a lot of people are enjoying the sunshine on the grass. You saw somebody familiar...hey that's Sadia, playing with her dogs - the stars of CSC110 - Bumbly and Mia!",
      "available_commands": {
        "go north": 7,
        "go south": 9,
        "go west": 4,
        "go under the bridge": 10,
        "talk with Sadia": 8
      },
      "items": []
    },
    {
      "id": 9,
      "name": "Myhal Center",
      "brief_description": "You are on the first floor of the Myhal Center. Proceed north to Front Campus and west to the gate.",
      "long_description": "You are on the first floor of the Myhal Center. Hundreds of students are rushing out from a engineering class in MY150. You see something familiar - your lucky UofT mug is on a table! But just as you hurried there, an engineering student ran by. You heard a loud sound and your mug got smashed to the floor by his backpack! What the hell! Now you need to fix it somewhere - maybe outside the campus?",
      "available_commands": {
        "go north": 8,
        "go west": 5,
        "pick up broken mug pieces (Ouch!)": 9
      },
      "items": ["mug"]
    },
    {
      "id": 10,
      "name": "Queen's Park",
      "brief_description": "You found yourself in Queen's Park. You see a crowd gathering.",
      "long_description": "You found yourself in Queen's Park. There is a crowd gathering and somebody speaking. It turns out to be the Ontario Premier Doug Ford and his supporter, running a campaign for the early election! Premier Ford offers you a hand - you can choose to be teleported to any location on campus.",
      "available_commands": {
        "Ford, Ford, Teleport": 10
      },
      "items": []
    },
    {
      "id": 11,
      "name": "T&T",
      "brief_description": "You arrived at the T&T supermarket. You can go back to campus by streetcar.",
      "long_description": "You arrived at the T&T supermarket, where a lot of magical stuffs are sold. You saw something that might be useful - a repairing potion that can fix broken objects.",
      "available_commands": {
        "buy potion": 11,
        "go back to campus": 6
      },
      "items": ["potion"]
    }
  ],
  "items": [
    {
      "name": "mug",
      "description": "Your UofT lucky mug that has been with you through every late-night study session, every major deadline, and every all-nighter.",
      "start_position": 9,
      "target_position": 1,
      "target_points": 0
    },
    {
      "name": "USB drive",
      "description": "The only copy of your game is stored in this USB.",
      "start_position": 70,
      "target_position": 1,
      "target_points": 0
    },
    {
      "name": "laptop charger",
      "description": "You need this to charge your laptop.",
      "start_position": 30,
      "target_position": 1,
      "target_points": 0
    },
    {
      "name": "potion",
      "description": "You can use this to fix broken objects (with 'Reparo!')",
      "start_position": 11,
      "target_position": 1,
      "target_points": 0
    },
    {
      "name": "hotdog",
      "description": "A food with delicious taste that makes you feel refresher than ever. Your moves left in the game will increase.",
      "start_position": 4,
      "target_position": 0,
      "target_points": 0
    },
    {
      "name": "key",
      "description": "The key to open your friend's dorm at Trinity College.",
      "start_position": 2,
      "target_position": 70,
      "target_points": 0
    },
    {
      "name": "PRESTO card",
      "description": "You can board streetcars with this card.",
      "start_position": 6,
      "target_position": 11,
      "target_points": 0
    }
  ]
}
